Adam-1974/Driver-BLDC-RPM-STM32G071G/Driver_BLDC_RPM_STM32G071G.ioc
#MicroXplorer Configuration settings - do not modify
File.Version=6
MxCube.Version=6.16.0
ProjectManager.ProjectName=Driver_BLDC_RPM_STM32G071G
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.CompilerOptimize=6
ProjectManager.DeviceId=STM32G071GBUx
ProjectManager.FirmwarePackage=STM32Cube FW_G0
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.StackSize=0x400
ProjectManager.HeapSize=0x200
Mcu.Name=STM32G071GBUx
Mcu.Family=STM32G0
Mcu.Package=UFBGA28
Mcu.UserName=STM32G071GBUx
RCC.FamilyName=M
RCC.HSI_VALUE=16000000
RCC.SYSCLKFreq_VALUE=64000000
RCC.HCLKFreq_VALUE=64000000
RCC.APBFreq_VALUE=64000000
RCC.APBTimFreq_VALUE=64000000
SYS.Debug=Serial_Wire
SYS.TimeBase=TIM6
PA2.GPIO_Label=BEMF_C
PA2.Mode=INM
PA2.Signal=COMP2_INM
PA3.GPIO_Label=BEMF_Vgnd
PA3.Mode=INP
PA3.Signal=COMP2_INP
PA5.GPIO_Label=CURRENT_FB
PA5.Signal=ADC1_IN5
PA7.GPIO_Label=LC
PA7.Signal=GPIO_Output
PA8.GPIO_Label=HC
PA8.Signal=S_TIM1_CH1
PA9.GPIO_Label=HB
PA9.Signal=S_TIM1_CH2
PA10.GPIO_Label=HA
PA10.Signal=S_TIM1_CH3
PB0.GPIO_Label=LB
PB0.Signal=GPIO_Output
PB7.GPIO_Label=BEMF_A
PB7.Mode=INM
PB7.Signal=COMP2_INM
PB8.GPIO_Label=WS2812B_2020
PB8.Signal=GPIO_Output
PB15.GPIO_Label=LA
PB15.Signal=GPIO_Output
PB3.GPIO_Label=BEMF_B
PB3.Mode=INM
PB3.Signal=COMP2_INM
TIM1.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
TIM1.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
TIM1.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
TIM1.Prescaler=0
TIM1.Period=4570
TIM1.IPParameters=Prescaler,Period,Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2,Channel-PWM Generation3 CH3
TIM6.IPParameters=Prescaler,Period
TIM6.Prescaler=63
TIM6.Period=99
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_5
ADC1.ContinuousConvMode=DISABLE
ADC1.DMAContinuousRequests=ENABLE
ADC1.IPParameters=Channel-0#ChannelRegularConversion,ContinuousConvMode,DMAContinuousRequests
COMP2.InputPlus=COMP_INPUT_PLUS_IO3
COMP2.InputMinus=COMP_INPUT_MINUS_IO3
COMP2.Hysteresis=COMP_HYSTERESIS_NONE
COMP2.OutputPol=COMP_OUTPUTPOL_NONINVERTED
COMP2.PowerMode=COMP_POWERMODE_HIGHSPEED
COMP2.IPParameters=InputPlus,InputMinus,Hysteresis,OutputPol,PowerMode
